[
  {
    "id": 1,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRHNuj6m-pR0nNxK4cXJxPnn6XsqI4qm4NGbg&s",
    "title": "Pride and Prejudice",
    "author": "Jane Austen",
    "category": "Classic",
    "rating": 4.8,
    "type": "online",
    "description": "A timeless romantic novel exploring the complexities of love, societal expectations, and personal growth. Elizabeth Bennet and Mr. Darcy’s evolving relationship highlights how pride and prejudice shape human behavior. With sharp wit and insightful social commentary, Austen masterfully portrays class, manners, and marriage in 19th-century England."
  },
  {
    "id": 2,
    "image": "https://d28hgpri8am2if.cloudfront.net/book_images/onix/cvr9781625584595/moby-dick-9781625584595_hr.jpg",
    "title": "Moby Dick",
    "author": "Herman Melville",
    "category": "Classic",
    "rating": 4.5,
    "type": "online",
    "description": "A powerful tale of obsession, fate, and human struggle. The story follows Captain Ahab’s relentless pursuit of the white whale, Moby Dick, symbolizing man's conflict with nature and himself. Rich with philosophical depth and maritime detail, it remains one of literature’s most profound explorations of ambition and madness."
  },
  {
    "id": 3,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQEAQdw6Hturcnia9BtHmxFjCCez0SYHw2NDA&s",
    "title": "1984",
    "author": "George Orwell",
    "category": "Dystopian",
    "rating": 4.9,
    "type": "online",
    "description": "A chilling portrayal of a totalitarian regime where surveillance, propaganda, and fear control every aspect of life. Winston Smith’s quiet rebellion reflects the struggle for truth and individuality. Orwell’s vision remains eerily relevant, warning how unchecked authority can erase freedom and reshape reality."
  },
  {
    "id": 4,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR_Z_icYE4jJ6YSP92fYrOS_dZHalFYHxzCtA&s",
    "title": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "category": "Classic",
    "rating": 4.7,
    "type": "online",
    "description": "Through the eyes of young Scout Finch, this novel explores racial injustice, morality, and empathy in the American South. Atticus Finch’s defense of an innocent man teaches powerful lessons about courage and integrity. The story blends childhood innocence with deep social critique."
  },
  {
    "id": 5,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSr3v10jQCtaX4-cIZg91quQ6YktgRNavHrAQ&s",
    "title": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "category": "Classic",
    "rating": 4.6,
    "type": "online",
    "description": "A dazzling reflection on the American Dream, wealth, and longing. Jay Gatsby’s pursuit of Daisy Buchanan symbolizes the illusions of love and ambition. Fitzgerald’s lyrical style and vivid imagery paint a haunting portrait of the Jazz Age’s glamour and emptiness."
  },
  {
    "id": 6,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQr-rcqkB_hglxbTSSKv3RMjYqslByD90Ehhw&s",
    "title": "War and Peace",
    "author": "Leo Tolstoy",
    "category": "Classic",
    "rating": 4.4,
    "type": "online",
    "description": "A monumental epic intertwining personal lives with historical events during the Napoleonic Wars. Through families like the Bolkonskys and Rostovs, Tolstoy examines love, destiny, power, and human nature. Its philosophical depth and realism make it one of literature’s greatest achievements."
  },
  {
    "id": 7,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTz2M8ZpBdtThc_pUjB7eHoGlOO7zDk_0SB_A&s",
    "title": "Crime and Punishment",
    "author": "Fyodor Dostoevsky",
    "category": "Classic",
    "rating": 4.7,
    "type": "online",
    "description": "A psychological masterpiece exploring guilt, morality, and redemption. Raskolnikov’s crime leads him into internal torment as he confronts his beliefs about good, evil, and human worth. Dostoevsky brilliantly examines the complexity of conscience and the struggle for salvation."
  },
  {
    "id": 8,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRvwLPJt12XspOM-Eu8_ZiMwHpx335wtf3kfg&s",
    "title": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "category": "Classic",
    "rating": 4.3,
    "type": "online",
    "description": "A coming-of-age story narrated by Holden Caulfield, who struggles with alienation, innocence, and society’s ‘phoniness’. His journey through New York explores teenage confusion, emotional pain, and the desire to protect purity. It remains a defining novel of youth identity."
  },
  {
    "id": 9,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSw4F4Q7wUDoP3nVx5oj9YO7N8uWG7kghLuEg&s",
    "title": "Brave New World",
    "author": "Aldous Huxley",
    "category": "Dystopian",
    "rating": 4.5,
    "type": "online",
    "description": "A futuristic society engineered for stability through genetic control, conditioning, and pleasure. Huxley’s world questions freedom, individuality, and the cost of a perfectly managed society. The novel warns how comfort and control can erase humanity’s deepest values."
  },
  {
    "id": 10,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTD1RY8i3RShS6UBJnsau1zgyI9Z2Z4xGeRCw&s",
    "title": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "category": "Fantasy",
    "rating": 4.8,
    "type": "online",
    "description": "Bilbo Baggins embarks on an unexpected adventure with dwarves and the wizard Gandalf. Filled with magic, danger, and courage, the story explores how ordinary individuals can rise to greatness. Tolkien’s world-building and charm make it a foundational fantasy classic."
  },
  {
    "id": 11,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRWsS_8sfRkXxbEF4-_Dl4p1OWJulGtRLznug&s",
    "title": "Fahrenheit 451",
    "author": "Ray Bradbury",
    "category": "Dystopian",
    "rating": 4.6,
    "type": "online",
    "description": "In a future where books are banned and ‘firemen’ burn them, Montag begins questioning society’s emptiness. Bradbury warns of censorship, technological distraction, and the loss of independent thought. A gripping, thought-provoking classic about the fight for knowledge."
  },
  {
    "id": 12,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSr7ELKccAkDdCoABqfvcQ1lRteegJev9Piew&s",
    "title": "Jane Eyre",
    "author": "Charlotte Bronte",
    "category": "Classic",
    "rating": 4.7,
    "type": "online",
    "description": "A strong-willed orphan, Jane Eyre overcomes hardship to find independence and love. Her relationship with Mr. Rochester reveals themes of morality, identity, and resilience. The novel blends romance with gothic mystery, creating a compelling story of self-respect and empowerment."
  },
  {
    "id": 13,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcToAW3AIWpci7KuZ8n1JirwJehmN4Bzor5MUA&s",
    "title": "Wuthering Heights",
    "author": "Emily Bronte",
    "category": "Classic",
    "rating": 4.5,
    "type": "online",
    "description": "A dark, intense story of passion and revenge set on the stormy Yorkshire moors. The destructive bond between Heathcliff and Catherine shapes generations. With its haunting atmosphere and emotional depth, it remains a unique masterpiece in English literature."
  },
  {
    "id": 14,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQGoatTHVfh7TLAVZo6-60yhCe-TGtpU34vgQ&s",
    "title": "The Odyssey",
    "author": "Homer",
    "category": "Epic",
    "rating": 4.6,
    "type": "online",
    "description": "A legendary epic following Odysseus’ long journey home after the Trojan War. Filled with gods, monsters, and heroic challenges, it explores loyalty, intelligence, and perseverance. Its timeless themes continue to influence storytelling across centuries."
  },
  {
    "id": 15,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR3LV_fb0THZYgf_bTtJtbgrfRlamZSTM7ciQ&s",
    "title": "Frankenstein",
    "author": "Mary Shelley",
    "category": "Horror",
    "rating": 4.4,
    "type": "online",
    "description": "Victor Frankenstein creates life, only to face the consequences of his ambition. This novel examines responsibility, isolation, and the desire for acceptance. Shelley blends science and gothic horror to explore humanity’s deepest fears."
  },
  {
    "id": 16,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSI7mMwS2iVCrmhfwq_oX0I_mkyK0L3QiRd8Q&s",
    "title": "Dracula",
    "author": "Bram Stoker",
    "category": "Horror",
    "rating": 4.5,
    "type": "online",
    "description": "A thrilling gothic horror tale told through letters and diaries. Count Dracula’s attempt to spread his influence creates suspense and fear. The novel explores superstition, sexuality, and the struggle between modernity and ancient evil."
  },
  {
    "id": 17,
    "image": "/images/pdf17.jpg",
    "title": "The Iliad",
    "author": "Homer",
    "category": "Epic",
    "rating": 4.6,
    "type": "online",
    "description": "Set during the Trojan War, this epic captures the rage of Achilles and the clash of heroes. With gods influencing human fate, it explores honor, pride, and mortality. A foundational work of Western literature."
  },
  {
    "id": 18,
    "image": "/images/pdf18.jpg",
    "title": "Les Misérables",
    "author": "Victor Hugo",
    "category": "Classic",
    "rating": 4.7,
    "type": "online",
    "description": "A sweeping tale of justice, redemption, and humanity. Jean Valjean’s transformation, pursued by Inspector Javert, intertwines with the struggles of revolutionary France. Hugo explores poverty, love, and moral duty with unmatched emotional depth."
  },
  {
    "id": 19,
    "image": "/images/pdf19.jpg",
    "title": "Anna Karenina",
    "author": "Leo Tolstoy",
    "category": "Classic",
    "rating": 4.6,
    "type": "online",
    "description": "A richly layered story of love, betrayal, and society. Anna’s tragic affair contrasts with Levin’s search for meaning. Tolstoy examines family, morality, and the constraints of social expectations with profound realism."
  },
  {
    "id": 20,
    "image": "/images/pdf20.jpg",
    "title": "The Brothers Karamazov",
    "author": "Fyodor Dostoevsky",
    "category": "Classic",
    "rating": 4.8,
    "type": "online",
    "description": "A philosophical novel exploring faith, free will, and morality through the turbulent relationships of the Karamazov brothers. Blending mystery with spiritual depth, Dostoevsky examines human nature, justice, and the struggle between reason and emotion."
  },
  {
    "id": 21,
    "image": "/images/pdf21.jpg",
    "title": "Great Expectations",
    "author": "Charles Dickens",
    "category": "Classic",
    "rating": 4.5,
    "type": "online",
    "description": "Pip’s journey from a humble childhood to unexpected fortune reveals themes of ambition, identity, and morality. Dickens portrays the clash between innocence and the desire for social advancement. With unforgettable characters like Miss Havisham and Estella, the novel explores personal growth and the true meaning of greatness."
  },
  {
    "id": 22,
    "image": "/images/pdf22.jpg",
    "title": "A Tale of Two Cities",
    "author": "Charles Dickens",
    "category": "Classic",
    "rating": 4.4,
    "type": "online",
    "description": "Set during the French Revolution, the novel contrasts the turmoil of Paris with the calm of London. Themes of sacrifice, resurrection, and injustice run through the story. Dickens masterfully captures the chaos and heroism of the era, delivering one of literature’s most powerful closing lines."
  },
  {
    "id": 23,
    "image": "/images/pdf23.jpg",
    "title": "Don Quixote",
    "author": "Miguel de Cervantes",
    "category": "Classic",
    "rating": 4.6,
    "type": "online",
    "description": "Often considered the first modern novel, this comedic and philosophical work follows Don Quixote and Sancho Panza on absurd yet meaningful adventures. It explores idealism, reality, and the human desire for purpose. Cervantes blends satire and heart, creating a timeless exploration of dreams and madness."
  },
  {
    "id": 24,
    "image": "/images/pdf24.jpg",
    "title": "Meditations",
    "author": "Marcus Aurelius",
    "category": "Philosophy",
    "rating": 4.7,
    "type": "online",
    "description": "A collection of personal writings by the Roman emperor reflecting Stoic philosophy. Aurelius explores self-discipline, virtue, resilience, and the importance of focusing on what we can control. Its timeless wisdom continues to guide readers seeking inner strength and mental clarity in a chaotic world."
  },
  {
    "id": 25,
    "image": "/images/pdf25.jpg",
    "title": "Siddhartha",
    "author": "Hermann Hesse",
    "category": "Philosophy",
    "rating": 4.6,
    "type": "online",
    "description": "A spiritual journey following Siddhartha’s search for enlightenment across life’s many paths—pleasure, suffering, and self-discovery. Hesse blends Eastern philosophy with poetic simplicity, offering profound insights into inner peace and the nature of existence. The novel remains a classic of philosophical literature."
  },
  {
    "id": 26,
    "image": "/images/pdf26.jpg",
    "title": "The Alchemist",
    "author": "Paulo Coelho",
    "category": "Philosophy",
    "rating": 4.8,
    "type": "online",
    "description": "Santiago’s quest to find his Personal Legend becomes a symbolic journey of destiny, faith, and self-discovery. Coelho blends magical storytelling with universal wisdom, urging readers to follow their dreams despite challenges. Its simplicity and inspiration have made it beloved across the world."
  },
  {
    "id": 27,
    "image": "/images/pdf27.jpg",
    "title": "The Little Prince",
    "author": "Antoine de Saint-Exupéry",
    "category": "Fantasy",
    "rating": 4.9,
    "type": "online",
    "description": "A poetic tale about a young prince traveling from planet to planet, each representing different human flaws and truths. Through simple storytelling and deep symbolism, the book explores love, loss, imagination, and what truly matters. It’s a timeless reflection on childhood and humanity."
  },
  {
    "id": 28,
    "image": "/images/pdf28.jpg",
    "title": "The Divine Comedy",
    "author": "Dante Alighieri",
    "category": "Epic",
    "rating": 4.6,
    "type": "online",
    "description": "A monumental epic following Dante’s journey through Hell, Purgatory, and Heaven. Rich with symbolism and medieval philosophy, it explores sin, redemption, and the soul’s spiritual ascent. Its vivid imagery and moral depth make it one of world literature’s greatest masterpieces."
  },
  {
    "id": 29,
    "image": "/images/pdf29.jpg",
    "title": "Hamlet",
    "author": "William Shakespeare",
    "category": "Drama",
    "rating": 4.8,
    "type": "online",
    "description": "Shakespeare’s iconic tragedy follows Prince Hamlet’s struggle with revenge, grief, and moral uncertainty after his father’s murder. The play examines madness, betrayal, and the complexity of human motives. Its language, psychological depth, and timeless themes make it a cornerstone of world drama."
  },
  {
    "id": 30,
    "image": "/images/pdf30.jpg",
    "title": "Macbeth",
    "author": "William Shakespeare",
    "category": "Drama",
    "rating": 4.7,
    "type": "online",
    "description": "A dark tale of ambition and moral downfall. Macbeth’s thirst for power, fueled by prophecy and manipulation, leads him down a destructive path. The play explores guilt, fate, and the consequences of unchecked desire. Shakespeare’s haunting imagery makes it unforgettable."
  },
  {
    "id": 31,
    "image": "/images/sale1.jpg",
    "title": "Atomic Habits",
    "author": "James Clear",
    "category": "Self-Help",
    "price": 12.99,
    "rating": 4.8,
    "type": "sale",
    "description": "Clear explains how small, consistent changes create remarkable long-term results. Using psychology and real-life examples, the book offers simple strategies for building good habits, breaking bad ones, and mastering daily routines. Its practical approach makes it one of the most effective self-improvement guides."
  },
  {
    "id": 32,
    "image": "/images/sale2.jpg",
    "title": "The Power of Habit",
    "author": "Charles Duhigg",
    "category": "Self-Help",
    "price": 10.99,
    "rating": 4.7,
    "type": "sale",
    "description": "Duhigg explores the science of habits—how they form, how they influence our lives, and how we can change them. Through engaging stories from business, sports, and psychology, he reveals how understanding habit loops can transform behavior and lead to success."
  },
  {
    "id": 33,
    "image": "/images/sale3.jpg",
    "title": "Deep Work",
    "author": "Cal Newport",
    "category": "Productivity",
    "price": 14.99,
    "rating": 4.6,
    "type": "sale",
    "description": "Newport explains the importance of focused, distraction-free work in a world filled with noise. The book provides strategies to boost concentration, improve productivity, and master complex skills. It’s essential reading for anyone seeking meaningful achievement in the modern digital age."
  },
  {
    "id": 34,
    "image": "/images/sale4.jpg",
    "title": "Thinking, Fast and Slow",
    "author": "Daniel Kahneman",
    "category": "Psychology",
    "price": 15.99,
    "rating": 4.8,
    "type": "sale",
    "description": "A groundbreaking exploration of how our minds make decisions. Kahneman describes two thinking systems—fast, intuitive thinking and slow, analytical thinking. The book reveals cognitive biases that influence judgment, helping readers understand how to make smarter choices and avoid mental traps."
  },
  {
    "id": 35,
    "image": "/images/sale5.jpg",
    "title": "Educated",
    "author": "Tara Westover",
    "category": "Biography",
    "price": 13.99,
    "rating": 4.7,
    "type": "sale",
    "description": "A powerful memoir about a young woman raised in a strict, isolated household who escapes through education. Tara’s journey from survival to self-discovery highlights the transformative power of learning and resilience. It’s an inspiring story of courage and identity."
  },
  {
    "id": 36,
    "image": "/images/sale6.jpg",
    "title": "Becoming",
    "author": "Michelle Obama",
    "category": "Biography",
    "price": 16.99,
    "rating": 4.9,
    "type": "sale",
    "description": "Michelle Obama shares her life story—from childhood to the White House. Honest and inspiring, the memoir explores family, ambition, leadership, and identity. It offers a heartfelt look at the experiences that shaped one of the world’s most influential women."
  },
  {
    "id": 37,
    "image": "/images/sale7.jpg",
    "title": "The Subtle Art of Not Giving a F*ck",
    "author": "Mark Manson",
    "category": "Self-Help",
    "price": 11.99,
    "rating": 4.5,
    "type": "sale",
    "description": "Manson challenges conventional positivity by arguing that life’s struggles give it meaning. Through blunt humor and practical advice, he encourages readers to focus on what truly matters and let go of unnecessary expectations. A refreshing approach to personal growth."
  },
  {
    "id": 38,
    "image": "/images/sale8.jpg",
    "title": "Grit",
    "author": "Angela Duckworth",
    "category": "Self-Help",
    "price": 12.49,
    "rating": 4.6,
    "type": "sale",
    "description": "Duckworth reveals how passion and perseverance—not talent—are key to long-term success. Combining research with inspiring stories, she shows how grit can be developed and why it matters. A motivating read for students, professionals, and anyone pursuing big goals."
  },
  {
    "id": 39,
    "image": "/images/sale9.jpg",
    "title": "Dare to Lead",
    "author": "Brené Brown",
    "category": "Leadership",
    "price": 13.49,
    "rating": 4.7,
    "type": "sale",
    "description": "Brown explores how courage, vulnerability, and empathy create strong leaders. Through research and practical insights, she shows how trust and authenticity transform teams and organizations. The book encourages leaders to embrace discomfort and lead with heart."
  },
  {
    "id": 40,
    "image": "/images/sale10.jpg",
    "title": "Start with Why",
    "author": "Simon Sinek",
    "category": "Leadership",
    "price": 10.99,
    "rating": 4.6,
    "type": "sale",
    "description": "Sinek explains how great leaders inspire action by focusing on purpose—the ‘why’ behind what they do. Using examples from business and history, he shows how clarity of mission drives trust, innovation, and success. A powerful guide for meaningful leadership."
  },
  {
    "id": 41,
    "image": "/images/sale11.jpg",
    "title": "The 7 Habits of Highly Effective People",
    "author": "Stephen R. Covey",
    "category": "Self-Help",
    "price": 14.99,
    "rating": 4.8,
    "type": "sale",
    "description": "Covey presents seven powerful habits that reshape personal and professional success. Focusing on responsibility, vision, communication, and continuous growth, the book blends timeless principles with practical frameworks. It's a transformative guide for building character, improving relationships, and living with purpose."
  },
  {
    "id": 42,
    "image": "/images/sale12.jpg",
    "title": "The Lean Startup",
    "author": "Eric Ries",
    "category": "Business",
    "price": 12.99,
    "rating": 4.7,
    "type": "sale",
    "description": "Ries introduces the Lean Startup methodology, focusing on innovation through rapid experimentation, validated learning, and adaptability. The book empowers entrepreneurs to build products that customers truly want while reducing risk and waste. A must-read for startup founders and innovators."
  },
  {
    "id": 43,
    "image": "/images/sale13.jpg",
    "title": "Zero to One",
    "author": "Peter Thiel",
    "category": "Business",
    "price": 11.99,
    "rating": 4.6,
    "type": "sale",
    "description": "Thiel explores how groundbreaking innovations move society from zero to one—creating something entirely new. He shares lessons on startups, monopoly thinking, and long-term vision. The book challenges conventional business ideas and inspires entrepreneurs to build unique, transformative companies."
  },
  {
    "id": 44,
    "image": "/images/sale14.jpg",
    "title": "Hooked",
    "author": "Nir Eyal",
    "category": "Business",
    "price": 13.49,
    "rating": 4.5,
    "type": "sale",
    "description": "Eyal reveals the psychology behind habit-forming products and explains the Hook Model—trigger, action, reward, and investment. Using examples from successful tech companies, the book helps creators design products that keep users engaged while understanding ethical responsibility."
  },
  {
    "id": 45,
    "image": "/images/sale15.jpg",
    "title": "The Art of War",
    "author": "Sun Tzu",
    "category": "Philosophy",
    "price": 9.99,
    "rating": 4.7,
    "type": "sale",
    "description": "An ancient Chinese text offering strategic wisdom on conflict, leadership, and discipline. Sun Tzu’s principles extend beyond warfare, guiding decisions in business, politics, and personal challenges. Its timeless insights emphasize preparation, adaptability, and understanding the opponent."
  },
  {
    "id": 46,
    "image": "/images/sale16.jpg",
    "title": "Meditations",
    "author": "Marcus Aurelius",
    "category": "Philosophy",
    "price": 10.99,
    "rating": 4.8,
    "type": "sale",
    "description": "Aurelius’s Stoic reflections offer guidance on self-control, duty, and inner peace. Written as private journal entries, this book helps readers face challenges with clarity and strength. Its simple yet profound wisdom remains deeply relevant today."
  },
  {
    "id": 47,
    "image": "/images/sale17.jpg",
    "title": "Sapiens",
    "author": "Yuval Noah Harari",
    "category": "History",
    "price": 16.99,
    "rating": 4.9,
    "type": "sale",
    "description": "Harari traces the journey of humankind—from ancient hunter-gatherers to modern global societies. Through engaging storytelling, he explains how biology, culture, and technology shaped our world. A powerful exploration of human evolution, beliefs, and future possibilities."
  },
  {
    "id": 48,
    "image": "/images/sale18.jpg",
    "title": "Homo Deus",
    "author": "Yuval Noah Harari",
    "category": "History",
    "price": 17.99,
    "rating": 4.8,
    "type": "sale",
    "description": "A provocative look at humanity’s future as technology, AI, and biotechnology reshape life. Harari explores potential new priorities—immortality, happiness, and godlike power. The book challenges readers to consider the moral and philosophical consequences of our next evolutionary leap."
  },
  {
    "id": 49,
    "image": "/images/sale19.jpg",
    "title": "The Psychology of Money",
    "author": "Morgan Housel",
    "category": "Finance",
    "price": 14.49,
    "rating": 4.7,
    "type": "sale",
    "description": "Housel explains how emotions and behavior shape financial decisions more than knowledge. Through relatable stories, he shows why understanding risk, patience, and long-term thinking is essential for wealth building. A simple yet powerful guide to money and mindset."
  },
  {
    "id": 50,
    "image": "/images/sale20.jpg",
    "title": "Rich Dad Poor Dad",
    "author": "Robert Kiyosaki",
    "category": "Finance",
    "price": 12.99,
    "rating": 4.6,
    "type": "sale",
    "description": "Kiyosaki contrasts two financial mindsets—one focused on job security, the other on investing and entrepreneurship. He highlights financial literacy, assets vs liabilities, and building passive income. The book encourages readers to rethink money and wealth-building strategies."
  },
  {
    "id": 51,
    "image": "/images/sale21.jpg",
    "title": "Thinking in Bets",
    "author": "Annie Duke",
    "category": "Psychology",
    "price": 13.99,
    "rating": 4.5,
    "type": "sale",
    "description": "Former poker champion Annie Duke explains how decision-making improves when we accept uncertainty and evaluate outcomes like bets. She blends psychology and strategy to help readers think rationally, reduce emotional bias, and make smarter long-term choices."
  },
  {
    "id": 52,
    "image": "/images/sale22.jpg",
    "title": "The Intelligent Investor",
    "author": "Benjamin Graham",
    "category": "Finance",
    "price": 15.99,
    "rating": 4.8,
    "type": "sale",
    "description": "A foundational book on value investing, teaching principles of risk management, market behavior, and rational decision-making. Graham’s insights guide investors to avoid speculation and build long-term financial stability. Considered essential reading for anyone entering the stock market."
  },
  {
    "id": 53,
    "image": "/images/sale23.jpg",
    "title": "Principles",
    "author": "Ray Dalio",
    "category": "Finance",
    "price": 16.49,
    "rating": 4.7,
    "type": "sale",
    "description": "Dalio shares the life and work principles that built one of the world’s most successful investment firms. The book emphasizes radical transparency, thoughtful decision-making, and systematic thinking. A blend of personal story and practical frameworks for success."
  },
  {
    "id": 54,
    "image": "/images/sale24.jpg",
    "title": "Deep Work",
    "author": "Cal Newport",
    "category": "Productivity",
    "price": 14.99,
    "rating": 4.6,
    "type": "sale",
    "description": "Newport argues that deep, focused work is the key to mastering complex skills and producing meaningful results. He provides actionable techniques to build discipline, reduce distraction, and create a high-value work routine in the digital age."
  },
  {
    "id": 55,
    "image": "/images/sale25.jpg",
    "title": "The Four Agreements",
    "author": "Don Miguel Ruiz",
    "category": "Self-Help",
    "price": 11.99,
    "rating": 4.7,
    "type": "sale",
    "description": "Ruiz presents four simple but powerful agreements for personal freedom: be impeccable with your word, don’t take anything personally, don’t make assumptions, and always do your best. Inspired by ancient Toltec wisdom, the book encourages inner peace and mindful living."
  },
  {
    "id": 56,
    "image": "/images/sale26.jpg",
    "title": "Awaken the Giant Within",
    "author": "Tony Robbins",
    "category": "Self-Help",
    "price": 12.99,
    "rating": 4.6,
    "type": "sale",
    "description": "Robbins provides strategies to take control of emotions, habits, finances, and relationships. Through motivational guidance and practical exercises, he empowers readers to reshape their lives and unlock personal potential. A highly influential self-transformation guide."
  },
  {
    "id": 57,
    "image": "/images/sale27.jpg",
    "title": "Man's Search for Meaning",
    "author": "Viktor E. Frankl",
    "category": "Psychology",
    "price": 13.49,
    "rating": 4.9,
    "type": "sale",
    "description": "Frankl reflects on his experiences in Nazi concentration camps and reveals how purpose helps humans endure suffering. Introducing logotherapy, he explains that meaning—not pleasure or power—is the core of a fulfilling life. A deeply moving and life-changing book."
  },
  {
    "id": 58,
    "image": "/images/sale28.jpg",
    "title": "Thinking, Fast and Slow",
    "author": "Daniel Kahneman",
    "category": "Psychology",
    "price": 15.99,
    "rating": 4.8,
    "type": "sale",
    "description": "Kahneman explores the two systems of human thinking—fast intuition and slow reasoning. He explains cognitive biases that cloud judgment and provides insights to improve decision-making. Essential reading for understanding how our minds truly work."
  },
  {
    "id": 59,
    "image": "/images/sale29.jpg",
    "title": "The Monk Who Sold His Ferrari",
    "author": "Robin Sharma",
    "category": "Self-Help",
    "price": 12.49,
    "rating": 4.6,
    "type": "sale",
    "description": "A fable about a successful lawyer who discovers a spiritual path after a life-changing crisis. Through Eastern wisdom and practical lessons, the book teaches balance, purpose, mindfulness, and joyful living. Inspirational and easy to apply."
  },
  {
    "id": 60,
    "image": "/images/sale30.jpg",
    "title": "The 48 Laws of Power",
    "author": "Robert Greene",
    "category": "Self-Help",
    "price": 14.99,
    "rating": 4.7,
    "type": "sale",
    "description": "Greene analyzes historical strategies of power, influence, and manipulation. Each law illustrates how people gain and maintain control in politics, leadership, and personal life. It’s a controversial yet insightful guide to understanding human behavior and ambition."
  }
]