[
    {
        "id": 1,
        "image": "https://th.bing.com/th/id/OIP.jkOttTP5AdWtfiHpT8u-xQHaJ4?w=131&h=180&c=7&r=0&o=7&cb=ucfimg2&dpr=1.3&pid=1.7&rm=3&ucfimg=1",
        "title": "Pride and Prejudice",
        "author": "Jane Austen",
        "rating": 4.8,
        "link": "https://bookmate.com/books/EnddbPfk",
        "details":"Pride and Prejudice is a romantic novel of manners written by Jane Austen in 1813. It explores issues of class, marriage, morality, and misunderstanding in early 19th century England. The story follows Elizabeth Bennet navigating love and societal pressures, especially with Mr. Darcy. Through witty dialogue, dramatic events, and sharp social commentary, the novel examines pride, prejudice, and personal growth. The narrative is detailed, showcasing character development and societal norms, making it a full rich story.",
        "bookContent": "Pride and Prejudice tells the story of Elizabeth Bennet, a sharp minded and independent young woman living in nineteenth century England. She belongs to a middle class family with five daughters. Society places great pressure on women to marry well. Elizabeth values intelligence and character more than wealth. Her life changes when the wealthy and reserved Mr. Darcy enters her social circle. At first, Darcy appears arrogant and proud. Elizabeth forms a negative opinion of him. Misunderstandings grow between them through gossip and social expectations. Jane Bennet, Elizabeth’s sister, develops feelings for Mr. Bingley. Their relationship faces obstacles due to class prejudice. Elizabeth witnesses the impact of rigid social norms. Darcy secretly begins to admire Elizabeth’s honesty and wit. Elizabeth slowly recognizes her own prejudices. A letter from Darcy changes her understanding of events. She reflects on her judgments and mistakes. Darcy works to correct his flaws. He becomes more humble and kind. Elizabeth sees his true character over time. Family reputation and social pressure create tension throughout the novel. The story includes balls, visits, and formal gatherings. Lady Catherine represents rigid class superiority. Lydia Bennet’s actions threaten family honor. Darcy intervenes quietly to help the Bennet family. Elizabeth realizes the depth of Darcy’s integrity. Love grows from mutual respect. Both characters mature emotionally. The novel highlights the importance of self awareness. Pride and prejudice are shown as human flaws. Austen uses humor and irony effectively. Social class divisions are criticized subtly. Women’s limited choices are clearly portrayed. Marriage is shown as both social and emotional. Elizabeth remains a strong female protagonist. The story emphasizes moral growth. Characters learn from their errors. The ending reflects personal transformation. True love triumphs over misunderstanding. Pride and Prejudice remains timeless. It reflects universal human behavior. Readers relate across generations. The novel blends romance and realism beautifully."
    },
    {
        "id": 2,
        "image": "https://tse3.mm.bing.net/th/id/OIP.KMtgWDCzXYAT-aMHQBng0QHaKi?cb=ucfimg2&ucfimg=1&rs=1&pid=ImgDetMain&o=7&rm=3",
        "title": "A Tale Of Two Cities",
        "author": "Charles Dickens",
        "rating": 4.5,
        "link": "https://www.gutenberg.org/files/98/old/2city12p.pdf",
        "details": "A Tale of Two Cities is a historical novel set in London and Paris before and during the French Revolution. It tells the story of Doctor Manette and his daughter Lucie, exploring resurrection, sacrifice, and the clash between oppression and justice. Dickens captures personal struggles and the turmoil of revolution with vivid characters, political intrigue, and complex plots. The narrative provides a deeper insight into the societal upheaval and human emotions, making it a fully detailed story.",
        "bookContent": "A Tale of Two Cities is set during the turbulent time of the French Revolution. The novel contrasts life in London and Paris. Doctor Manette is imprisoned unjustly for many years. His release marks a theme of resurrection. Lucie Manette becomes a symbol of compassion and hope. Charles Darnay renounces his aristocratic past. He seeks a peaceful life in England. Sydney Carton appears careless and self destructive. Beneath his behavior lies deep emotional pain. Revolutionary France descends into chaos and violence. Dickens shows the suffering of common people. Aristocratic cruelty fuels revolutionary anger. Madame Defarge embodies vengeance and resentment. The guillotine becomes a symbol of terror. Family loyalty is repeatedly tested. Love and sacrifice guide moral choices. Sydney Carton loves Lucie silently. His life lacks purpose initially. Carton’s transformation is gradual. He discovers redemption through self sacrifice. He chooses to save Darnay’s life. His final act gives meaning to his existence. The novel emphasizes resurrection through sacrifice. Dickens criticizes injustice and oppression. He warns against uncontrolled revenge. Violence consumes both guilty and innocent. Characters struggle with fate and destiny. Compassion is shown as a powerful force. The novel balances personal stories with political events. Emotional depth strengthens historical drama. Dickens uses symbolism throughout the narrative. Light and darkness reflect hope and despair. The story questions moral responsibility. Human dignity remains central. Carton’s final words are unforgettable. Love motivates heroic acts. The ending is tragic yet hopeful. Redemption remains possible even at the end. The novel reflects social inequality. It highlights humanity amid destruction. A Tale of Two Cities remains influential. Its themes remain relevant. The story reminds readers of moral courage. It shows the cost of injustice. Dickens delivers a powerful historical message."
    },
    {
        "id": 3,
        "image": "https://th.bing.com/th/id/R.21a697afe152607690fe5fea537e5789?rik=Lx76iZ2WUYeirA&riu=http%3a%2f%2fwww.fashiongonerogue.com%2fwp-content%2fuploads%2f2015%2f09%2fMichael-Fassbender-Marion-Cotillard-Macbeth-Poster.jpg&ehk=0%2bBTkW1vpm9djQD6orErDYl5csRJqc2cXSazMOjkgkY%3d&risl=&pid=ImgRaw&r=0",
        "title": "Macbeth",
        "author": "William Shakespeare",
        "rating": 4.9,
        "link": "https://example.com/1984.pdf",
        "details": "Macbeth is a tragedy by William Shakespeare about ambition, guilt, and fate. The play follows Macbeth as he murders King Duncan to seize the throne, driven by prophecy and Lady Macbeth's encouragement. His descent into tyranny, paranoia, and madness is depicted in detail. Lady Macbeth's unraveling, coupled with political intrigue, makes the story richer and more intense. Themes include moral corruption, power struggles, and human vulnerability.",
        "bookContent": "Macbeth is a tragic play about ambition and power. Macbeth begins as a loyal Scottish general. He receives a prophecy from three witches. They predict he will become king. Ambition awakens within him. Lady Macbeth encourages his dark desires. She questions his masculinity and courage. Macbeth murders King Duncan. He gains the throne through violence. Guilt immediately haunts him. He begins to see visions. Fear dominates his mind. He orders further murders to secure power. Banquo’s death is planned. Banquo’s ghost appears to Macbeth. His paranoia intensifies. Lady Macbeth suffers mental breakdown. She sleepwalks and relives guilt. Blood imagery reflects moral corruption. Macbeth becomes a tyrant. Scotland suffers under his rule. Prophecies continue to mislead him. He believes himself invincible. Overconfidence blinds his judgment. Nature turns against him symbolically. Lady Macbeth dies in despair. Macbeth reflects on life’s meaninglessness. He realizes the emptiness of power. His enemies unite against him. The final battle approaches. Macbeth fights bravely despite knowing fate. He is ultimately defeated. Order is restored to Scotland. Shakespeare explores fate versus free will. Ambition destroys moral values. Guilt becomes psychological punishment. Supernatural elements heighten tension. Darkness symbolizes evil. Loyalty and betrayal contrast sharply. Violence leads to isolation. Power gained unjustly cannot last. Macbeth’s downfall is inevitable. The play warns against unchecked ambition. It reveals human vulnerability. The tragedy remains powerful. Shakespeare’s language adds intensity. Macbeth continues to resonate with audiences."
    },
    {
        "id": 4,
        "image": "https://tse2.mm.bing.net/th/id/OIP.RMilb4B1keZvt0GUXVIjmwHaL0?cb=ucfimg2&ucfimg=1&rs=1&pid=ImgDetMain&o=7&rm=3",
        "title": "Hamlet",
        "author": "William Shakespeare",
        "rating": 4.7,
        "link": "https://example.com/to-kill-mockingbird.pdf",
        "details": "Hamlet, Prince of Denmark, is confronted with the task of avenging his father's mysterious death. The play delves deep into themes of revenge, madness, betrayal, and mortality. Hamlet's internal struggles and philosophical reflections are intricately explored, showing his complex moral dilemmas. The narrative vividly portrays the intrigue, deception, and emotional turbulence in the Danish court, providing a much richer and fuller story experience.",
        "bookContent": "Hamlet is a tragedy centered on revenge and moral conflict. Prince Hamlet mourns his father’s death. His mother quickly marries King Claudius. Hamlet feels betrayed and disturbed. His father’s ghost reveals murder. Claudius is exposed as the killer. Hamlet struggles with doubt and conscience. He questions the ghost’s truth. He pretends madness to observe others. His behavior confuses the court. Ophelia becomes emotionally distressed. Polonius spies on Hamlet. Hamlet accidentally kills Polonius. Guilt and chaos spread. Ophelia descends into madness. She later drowns tragically. Laertes seeks revenge for his family. Claudius plots Hamlet’s death. Hamlet reflects on life and death. His soliloquies explore existence. The famous “to be or not to be” speech reveals inner struggle. Hamlet delays action repeatedly. His intelligence deepens the tragedy. Betrayal dominates the royal court. Corruption infects Denmark. Fortinbras represents decisive action. The play contrasts thought and action. Hamlet eventually accepts fate. A duel is arranged. Poison is used deceitfully. Gertrude dies by poison. Laertes confesses the plot. Hamlet kills Claudius. Hamlet himself is fatally wounded. He forgives Laertes. Order is restored after chaos. Fortinbras becomes king. Shakespeare explores human psychology deeply. The play examines grief and morality. Madness appears both real and feigned. Loyalty is constantly tested. Words hold powerful meaning. Death surrounds the narrative. Hamlet’s tragedy lies in indecision. The play remains timeless. It reflects universal human conflict. Shakespeare’s language enriches emotion. Hamlet endures as a masterpiece."
    },
    {
        "id": 5,
        "image": "https://www.bookishelf.com/wp-content/uploads/2020/02/Book-Review-The-Kite-Runner-by-Khaled-Hosseini.jpg",
        "title": "The Kite Runner",
        "author": "Khaled Hosseini",
        "rating": 4.6,
        "link": "https://example.com/great-gatsby.pdf",
        "details": "The Kite Runner tells a story of friendship, betrayal, and redemption in Afghanistan. Amir, the protagonist, struggles with guilt after betraying his childhood friend Hassan. The novel explores themes of family, forgiveness, and complex human relationships. The narrative spans decades, including detailed accounts of childhood, war, immigration, and Amir's journey to atone for past mistakes, giving the story full richness and depth.",
        "bookContent": "The Kite Runner is set in Afghanistan and the United States. Amir grows up in Kabul. Hassan is his loyal friend. They share childhood memories. Social class divides them. A traumatic event changes everything. Amir betrays Hassan out of fear. Guilt follows him into adulthood. Political unrest disrupts their lives. Afghanistan faces invasion and war. Amir and his father flee to America. Amir struggles with identity and belonging. He becomes a writer. Memories of the past haunt him. Hassan remains loyal despite suffering. Years later Amir returns to Afghanistan. He seeks redemption for past sins. The country is devastated by conflict. Amir learns about Hassan’s fate. He risks his life to save Hassan’s son. Violence tests Amir’s courage. Pain becomes part of redemption. Amir confronts his fear. Father son relationships influence decisions. Baba’s past secrets are revealed. Forgiveness becomes central. Loyalty defines true character. Hosseini explores guilt deeply. The novel shows cultural change. Childhood innocence contrasts with adult regret. Friendship shapes destiny. The kite symbolizes hope. The past cannot be erased. Facing truth brings healing. Love motivates sacrifice. Afghanistan’s history forms the backdrop. Emotional storytelling drives the narrative. Redemption requires suffering. Courage grows through hardship. The novel addresses trauma. Family bonds remain strong. Loss shapes identity. The ending offers hope. Amir finds peace through action. The story emphasizes moral responsibility. Hosseini blends personal and political themes. The Kite Runner remains emotionally powerful."
    },
    {
        "id": 6,
        "image": "https://i.harperapps.com/hcanz/covers/9780008239411/x293.jpg",
        "title": "The City Of Brass",
        "author": "S.A Chakraborty",
        "rating": 4.4,
        "link": "https://example.com/war-and-peace.pdf",
        "details": "The City of Brass follows Nahri, a clever con artist in 18th century Cairo, who discovers her magical heritage. She is drawn into the intricate politics of the djinn, ancient rivalries, and forbidden love. The story now includes extended details on magical lore, city descriptions, character motivations, political schemes, and personal growth. Every scene is enriched with action, dialogue, and intrigue, making the story immersive and full-length.",
        "bookContent": "The City of Brass is a fantasy novel rich in mythology. Nahri survives as a con artist in Cairo. She unknowingly heals people magically. Her life changes when she summons a djinn. She discovers her true heritage. Nahri is taken to Daevabad. The city is hidden and magical. Djinn tribes control politics. Ancient rivalries shape society. Nahri struggles with identity. She learns healing magic. Court politics are dangerous. Trust becomes difficult. Ali represents moral conflict. Dara embodies loyalty and secrecy. Power divides families and clans. Religious tension shapes the city. Nahri becomes involved in political intrigue. Her choices have consequences. History influences present conflict. Magic is tied to bloodlines. Cultural conflict is explored deeply. Loyalty is constantly tested. Nahri grows emotionally. She questions authority. Justice and oppression are central themes. The city’s beauty hides cruelty. Chakraborty blends history and fantasy. World building is detailed. Female strength is emphasized. Nahri refuses submission. She challenges tradition. Relationships are complex. Betrayal changes alliances. The past haunts characters. Power demands sacrifice. Moral choices drive the plot. Violence disrupts peace. Compassion offers hope. The story explores belonging. Identity evolves through struggle. Magic reflects inner strength. The narrative balances action and emotion. Cultural diversity enriches the story. The City of Brass begins an epic saga. It introduces a vivid world. The novel remains immersive."
    },
    {
        "id": 7,
        "image": "https://tse4.mm.bing.net/th/id/OIP.hINnNvJdDyeaGTu9fQ7kfAHaLU?cb=ucfimg2&ucfimg=1&rs=1&pid=ImgDetMain&o=7&rm=3",
        "title": "The Abc Murders",
        "author": "Agatha Christie",
        "rating": 4.7,
        "link": "https://example.com/crime-punishment.pdf",
        "details": "The City of Brass follows Nahri, a clever con artist in 18th century Cairo, who discovers her magical heritage. She is drawn into the intricate politics of the djinn, ancient rivalries, and forbidden love. The story now includes extended details on magical lore, city descriptions, character motivations, political schemes, and personal growth. Every scene is enriched with action, dialogue, and intrigue, making the story immersive and full-length.",
        "bookContent": "The ABC Murders is a classic detective mystery. Hercule Poirot receives a threatening letter. The killer signs as ABC. Murders occur alphabetically. Each victim’s name follows the pattern. Poirot works with Captain Hastings. Police face confusion and fear. Public panic increases. The killer taunts Poirot intellectually. Clues appear misleading. Red herrings confuse investigators. Poirot analyzes human psychology. Suspects multiply rapidly. Patterns become deceptive. Each murder location adds complexity. Poirot focuses on motive. He questions surface logic. Christie misleads the reader deliberately. A false pattern distracts police. Poirot identifies manipulation. The true motive is personal. The alphabet pattern hides intention. The murderer exploits assumptions. Psychological tension builds steadily. Poirot’s reasoning stands out. He values observation. He studies emotional reactions. Justice depends on intelligence. The killer’s arrogance leads to mistakes. Poirot exposes the truth publicly. Order is restored. The novel explores obsession. Crime is shown as calculated. Human weakness is exploited. Logic defeats deception. Suspense remains constant. Christie’s plotting is precise. Dialogue enhances tension. The novel challenges reader assumptions. Poirot’s brilliance dominates the narrative. The story examines morality. Crime has consequences. Innocence suffers. Truth emerges through patience. The ending surprises readers. The ABC Murders remains influential. It defines detective fiction."
    },
    {
        "id": 8,
        "image": "https://tse3.mm.bing.net/th/id/OIP.rE9SxXVdi7dx7vyQ0a9DNwHaLH?cb=ucfimg2&ucfimg=1&rs=1&pid=ImgDetMain&o=7&rm=3",
        "title": "A Study In Scarlet",
        "author": "Arthur Conan Doyle",
        "rating": 4.3,
        "link": "https://example.com/catcher-rye.pdf",
        "details": "A Study in Scarlet is the first Sherlock Holmes novel by Arthur Conan Doyle. It introduces Holmes and Dr. Watson and involves a complex murder case connected to revenge and hidden motives. The story now contains extended descriptions of characters, setting, investigation clues, and narrative twists. It provides a fuller, immersive experience with rich detail and suspense, capturing the reader's attention throughout the novel.",
        "bookContent": "A Study in Scarlet introduces Sherlock Holmes. Dr Watson meets Holmes in London. They become roommates. A mysterious murder occurs. The crime scene appears puzzling. Holmes applies deductive reasoning. He observes minute details. Police struggle to find clues. Holmes identifies patterns others miss. Watson narrates the investigation. Holmes’s personality is unusual. His methods seem strange. The victim has no visible wounds. Strange writing appears at the scene. Holmes follows logical connections. The story shifts to a past narrative. A tale of love and revenge unfolds. Events in America explain the motive. Betrayal fuels hatred. The murderer seeks justice personally. Holmes connects past and present. His reasoning impresses Watson. The novel blends mystery and emotion. Revenge drives human actions. Conan Doyle establishes detective conventions. Holmes’s logic defines the genre. Observation is shown as powerful. Watson balances Holmes’s intellect. The story includes moral complexity. Justice is not always legal. The novel explores human suffering. Love motivates crime. Loss shapes decisions. Holmes remains detached. Emotion contrasts with logic. The investigation unfolds step by step. Clues gain meaning later. The resolution is satisfying. Holmes reveals truth calmly. The novel sets foundation for future stories. Sherlock Holmes becomes iconic. Deductive science dominates crime solving. A Study in Scarlet remains significant. It introduces a legendary partnership. The novel changed detective fiction forever."
    }
]
